In [1]:
import numpy as np

In [4]:
# № 1
a = np.array([[1, 6],
              [2, 8],
              [3, 11],
              [3, 10],
              [1, 7]])
a

array([[ 1,  6],
       [ 2,  8],
       [ 3, 11],
       [ 3, 10],
       [ 1,  7]])

In [11]:
mean_a = a.mean(axis = 0)
print(f"Среднее значение по признаку: {mean_a}")

Среднее значение по признаку: [2.  8.4]

In [13]:
# № 2
a_centered = a - mean_a
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

In [25]:
# № 3
a_centered_sp = a_centered.T[0] @ a_centered.T[1]
print(a_centered_sp)
result = a_centered_sp / (a_centered.shape[0] - 1)
print(result)

8.0
2.0

In [28]:
# № 4

total = np.cov(a.T)
print(total)
print(total[0, 1])

[[1.  2. ]
 [2.  4.3]]
2.0

### Pandas

In [2]:
# № 1
import pandas as pd

In [4]:
authors = pd.DataFrame({
    'authors_id': [1, 2, 3],
    'authors_name': ['Тургеньев', 'Чехов', 'Островский'],
})

authors

   authors_id authors_name
0           1    Тургеньев
1           2        Чехов
2           3   Островский

In [5]:
book = pd.DataFrame({
    'authors_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    'price': [450, 300, 350, 500, 450, 370, 290],
})
book

   authors_id            book_title  price
0           1           Отцы и дети    450
1           1                 Рудин    300
2           1     Дворянское гнездо    350
3           2      Толстый и тонкий    500
4           2       Дама с собачкой    450
5           3                 Гроза    370
6           3  Таланты и поклонники    290

In [9]:
# № 2
authors_price = pd.merge(authors, book, on='authors_id', how='outer')
authors_price

   authors_id authors_name            book_title  price
0           1    Тургеньев           Отцы и дети    450
1           1    Тургеньев                 Рудин    300
2           1    Тургеньев     Дворянское гнездо    350
3           2        Чехов      Толстый и тонкий    500
4           2        Чехов       Дама с собачкой    450
5           3   Островский                 Гроза    370
6           3   Островский  Таланты и поклонники    290

In [25]:
# № 3

top_5 = authors_price.nlargest(5, "price")
top_5.reset_index(drop=True, inplace=True)

top5 = authors_price.sort_values(by='price', ascending=False)
top5.reset_index(drop=True, inplace=True)
top5.drop([5, 6], axis=0, inplace=True)

print(top5)
print()
print(top_5)

   authors_id authors_name         book_title  price
0           2        Чехов   Толстый и тонкий    500
1           1    Тургеньев        Отцы и дети    450
2           2        Чехов    Дама с собачкой    450
3           3   Островский              Гроза    370
4           1    Тургеньев  Дворянское гнездо    350

   authors_id authors_name         book_title  price
0           2        Чехов   Толстый и тонкий    500
1           1    Тургеньев        Отцы и дети    450
2           2        Чехов    Дама с собачкой    450
3           3   Островский              Гроза    370
4           1    Тургеньев  Дворянское гнездо    350

In [72]:
# № 4
groupby = authors_price.groupby("authors_name")

authors_stat = pd.DataFrame({
   'author_name': authors_price["authors_name"].unique(),
   'min_price' : groupby['price'].min(),
   'max_price' : groupby['price'].max(),
   'mean_price' : groupby['price'].mean(),
})

authors_stat

             author_name  min_price  max_price  mean_price
authors_name
Островский    Островский        290        370  330.000000
Тургеньев      Тургеньев        300        450  366.666667
Чехов              Чехов        450        500  475.000000

In [96]:
# № 5
import numpy as np
authors_price['cover'] = ['твердая', 'мягкая','мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']


book_info = pd.pivot_table(authors_price, values='price', index=['authors_name'], columns=['cover'], aggfunc=np.sum)
book_info['мягкая'] = book_info['мягкая'].fillna("0")
book_info['твердая'] = book_info['твердая'].fillna("0")
print(book_info)
book_info.to_pickle("book_info.pkl")
book_info_2 = pd.read_pickle("book_info.pkl")
print()
print(book_info_2)

cover        мягкая твердая
authors_name
Островский        0     660
Тургеньев       650     450
Чехов           950       0

cover        мягкая твердая
authors_name
Островский        0     660
Тургеньев       650     450
Чехов           950       0